<a href="https://colab.research.google.com/github/doungge/Multicampus-/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 구조적 데이터 표시와 처리에 강한 pandas

- 파이썬을 이용하면 다량의 데이터를 손쉽게 처리할 수 있음
- 파이썬에서 데이터 분석과 처리를 쉽게 할 수 있게 도와주는 것이 바로 pandas 라이브러리
- pandas는 NumPy를 기반으로 만들어졌지만 좀 더 복잡한 데이터 분석에 특화
- NumPy가 같은 데이터 타입의 배열만 처리할 수 있는데 반해 
- pandas는 데이터 타입이 다양하게 섞여 있을 대도 처리할 수 있음
- pandas 홈페이지(https://pandas.pydata.org)

## 구조적 데이터 생성하기

### Series를 활용한 데이터 생성

- NumPy 처럼 pandas도 보통 다음과 같이 `import ~as~`형식으로 불러옴
``` 
import pandas as pd
```
- pandas를 불러오면 이제 pandas를 이용할때 pandas 대신 pd를 이용할 수 있다.
- pandas에서 데이터를 생성하는 가장 기본적인 방법은 Series()을 이용하는 것이다.
- Series()을 이용하면 Series형식의 구조적 데이터(라벨을 갖는 1차원 데이터)를 생성할 수 있음
- Serise()를 이용해 Series형식의 데이터를 생성하는 방법
- s=pd.Series(seq_data)
- Series()의 인자로는 시퀀스데이터가 들어감
- 시퀀스데이터(seq_data)로는 리스트와 튜플 타입의 데이터를 모두 사용할 수 있지만 주로 리스트 데이터를 이용
- 지정하면 인자로 넣은 시퀀스 데이터(seq_data)에 순서로 표시하는 라벨이 자동으로 부여
- Series() 데이터에서는 세로출 라벨을 Index라고 하고, 입력한 시퀀스 데이터를 values라고한다.

In [4]:
import pandas as pd #pandas 호출
#Seires() 데이터의 구조
s1 = pd.Series([10,20,30,40,50])
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

- Series 데이터를 출력하면 데이터 앞에 index가 함게 표시된다.
- index는 Series데이터 생성시 자동으로 만들어진 것으로 데이터를 처리할 때 이용
- Series 데이터는 index와 values를 분리해서 가져올 수 있음
- Series데이터를 s라고 할때 indexsms `s.index`로 values는 `s.values`로 가져올 수 있음

In [ ]:
#Series 데이터에서 index를 가져온 예
s1.index
print(s1.index)

RangeIndex(start=0, stop=5, step=1)

- RangeIndex는 index를 범위로 표시했음을 의미
- index의 범위는 `start ~stop-1`이며 간격은 step만큼씩 증가

In [ ]:
#Series데이터에서 values를 가져온 예
print(s1.values)

[10 20 30 40 50]

- Numpy의 배열과 형식이 같다.

- NumPy의 경우 배열의 모든 원소가 데이터 타입이 같아야 했지만 pandas의 경우에는 원소의 데이터 타입이 달라도 됨

In [ ]:
#Series()로 데이터를 생성할 때 문자와 숫자가 혼합된 리스트를 인자로 이용
s2 = pd.Series(['a','b','c',1,2,3])
s2

0    a
1    b
2    c
3    1
4    2
5    3
dtype: object

In [ ]:
#데이터 가 없으면 NumPy를 임포트한 후 np.nan으로 데이터가 없다고 표시할 수 있음
#np.nan을 이용해서 Series에 데이터에 특정 원소가 없음을 표시한 예
import numpy as np
s3 = pd.Series([np.nan,10,30])
s3

0     NaN
1    10.0
2    30.0
dtype: float64

- NaN은 데이터가 없다는 것을 의미
- 데이터를 위한 자리(index)는 있지만 실제 값은 없다는 의미이다.


- Series 데이터를 생성할때 다음과 같이 인자로 index를 추가할 수 있음
- s=pd.Series(seq_data, index = index_seq)
- 인자로 index를 명시적으로 입력하면 Series 변수(s)의 index에는 자동 생성되는 index대신 index_seq가 들어가게 됨
- index_seq도 리스트와 튜플 타입의 데이터를 모두 사용할 수있지만 주로 리스트 데이터를 이용
- seq_data의 항목 개수와 index_seq의 항목 개수는 같아야 한다는 것


- 어느 가게의 날짜별 판매량을 pandas의 Series()형식으로 입력
- 하루는 판매량 데이터가 없어서 np.nan을 입력

In [ ]:
index_data = ['2018-10-07','2018-10-08','2018-10-09','2018-10-10']
s4 = pd.Series([200,195, np.nan, 205], index=index_data)
s4

2018-10-07    200.0
2018-10-08    195.0
2018-10-09      NaN
2018-10-10    205.0
dtype: float64

- index에는 입력 인자 index의 리스트 데이터가 지정됐음을 확인


- 리스트 형식의 데이터와 index를 따로 입력했지만 파이썬의 딕셔너리를 이요하면 데이터와 index를 합께 입력할 수 있음
- s=pd.Series(dict_data)
- 입력 인자로 딕셔너리 데이터를 입력하면 딕셔너리 데이터의 키(keys)와 값(values)이 각각 Series 데이터의 index와 values로 들어감

In [ ]:
#Series 데이터의 index는 국어, 영어, 수학으로 지정됐고 values는 100.95,90으로 지정된 것을 확인
s5 = pd.Series({'국어':100,'영어':95,'수학':90})
s5

국어    100
영어     95
수학     90
dtype: int64

### 날짜 자동생성 : data_range


- index에 날짜를 입력할때 `index = ['2018-10-07','2018-10-08','2018-10-09','2018-10-10']`처럼 문자열을 하나씩 입력
- pandas에서 제공하는 data_range()
- 원하는 날짜를 자동으로 생성하므로 날짜 데이터를 입력할때 편리
- pd.data_range(start=None,end=None,periods=None,freq='D)
- start는 시작 날짜, end는 끝 날짜, periods는 날짜 데이터 생성 기간, freq는 날짜 데이터 생성 주기를 나타냄
- start는 반드시 있어야하며 periods는 둘 중 하나만 있어도 됨
- freq를 입력하지 않으면 'D'옵션이 설정돼 달력 기준으로 하루씩 증가


- 시작 날짜와 끝 날짜를 지정해 날짜 데이터를 생성

In [8]:
import pandas as pd
#시작 날짜에서 끝 날짜 까지 하루씩 증가한 날짜 데이터 생성의 예
pd.date_range(start='2019-01-01', end = '2019-01-07')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [11]:
#생성된 날짜의 데이터형식은 모두 yyyy-mm-dd
print(pd.date_range(start='2019/01/01',end='2019/01/07'))
print(pd.date_range(start='01-01-2019',end='01-07-2019'))
print(pd.date_range(start='2019-01-01',end='01.07.2019'))

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')
DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')
DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

- 시작 날짜와 끝 날짜를 지정해 날짜 데이터를 생성했는데 끝 날짜를 지정하지 않고 periods를 입력해서 날짜를 생성
- 시작 날짜로부터 7개의 날짜가 하루씩 증가해 생성
- freq 옵션을 쓰지 않으면 기본적으로 'D'가 저장되어 하루씩 날짜가 증가

In [12]:
pd.date_range(start = '2019-01-01',periods=7)

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [15]:
#2일씩 증가하는 날짜 생성
pd.date_range(start = '2019-01-01', periods=4,freq='2D')

DatetimeIndex(['2019-01-01', '2019-01-03', '2019-01-05', '2019-01-07'], dtype='datetime64[ns]', freq='2D')

In [19]:
#달력의 요일을 기준으로 일주일씩 증가하는 날짜를 생성
pd.date_range(start = '2019-01-01',periods=4, freq='W')

DatetimeIndex(['2019-01-06', '2019-01-13', '2019-01-20', '2019-01-27'], dtype='datetime64[ns]', freq='W-SUN')

In [20]:
#업무일 기준 2개월 월말 주기로 12개의 날짜를 생성한 예 비즈데이 기준으로 공휴일을 제외
pd.date_range(start = '2019-01-01', periods=12, freq='2BM')

DatetimeIndex(['2019-01-31', '2019-03-29', '2019-05-31', '2019-07-31',
               '2019-09-30', '2019-11-29', '2020-01-31', '2020-03-31',
               '2020-05-29', '2020-07-31', '2020-09-30', '2020-11-30'],
              dtype='datetime64[ns]', freq='2BM')

In [22]:
#분기 시작일 기준으로 4개의 날짜를 생성한 예
pd.date_range(start= '2019-01-01', periods=4, freq='QS')

DatetimeIndex(['2019-01-01', '2019-04-01', '2019-07-01', '2019-10-01'], dtype='datetime64[ns]', freq='QS-JAN')

In [24]:
#연도의 첫날을 기준으로 1년 주기로 3개의 날짜를 생성한 예
pd.date_range(start = '2019-01-01',periods=3, freq ='AS')

DatetimeIndex(['2019-01-01', '2020-01-01', '2021-01-01'], dtype='datetime64[ns]', freq='AS-JAN')

- date_range()를 이용해 날짜뿐만 아니라 시간을 생성하는 방법

In [26]:
# 1시간 주기로 10개의 시간을 생성한 예
pd.date_range(start='2019-01-01 08:00', periods=10, freq ='H')

DatetimeIndex(['2019-01-01 08:00:00', '2019-01-01 09:00:00',
               '2019-01-01 10:00:00', '2019-01-01 11:00:00',
               '2019-01-01 12:00:00', '2019-01-01 13:00:00',
               '2019-01-01 14:00:00', '2019-01-01 15:00:00',
               '2019-01-01 16:00:00', '2019-01-01 17:00:00'],
              dtype='datetime64[ns]', freq='H')

In [27]:
#업무 시간을 기준으로(한시간 앞) 1시간 주기로 10개의 시간을 생성하는 예
pd.date_range(start='2019-01-01 08:00', periods=10, freq ='BH')

DatetimeIndex(['2019-01-01 09:00:00', '2019-01-01 10:00:00',
               '2019-01-01 11:00:00', '2019-01-01 12:00:00',
               '2019-01-01 13:00:00', '2019-01-01 14:00:00',
               '2019-01-01 15:00:00', '2019-01-01 16:00:00',
               '2019-01-02 09:00:00', '2019-01-02 10:00:00'],
              dtype='datetime64[ns]', freq='BH')

In [28]:
# 30분 단위로 4개의 시간을 생성한 예
pd.date_range(start='2019-01-01 10:00', periods=4, freq ='30min')

DatetimeIndex(['2019-01-01 10:00:00', '2019-01-01 10:30:00',
               '2019-01-01 11:00:00', '2019-01-01 11:30:00'],
              dtype='datetime64[ns]', freq='30T')

In [29]:
# 분 단위를 'T'로 입력해도 결과는 같음
pd.date_range(start='2019-01-01 10:00', periods=4, freq ='30T')

DatetimeIndex(['2019-01-01 10:00:00', '2019-01-01 10:30:00',
               '2019-01-01 11:00:00', '2019-01-01 11:30:00'],
              dtype='datetime64[ns]', freq='30T')

In [30]:
#10초 단위로 증가하면서 4개의 시간을 생성
pd.date_range(start='2019-01-01 10:00', periods=4, freq ='10S')

DatetimeIndex(['2019-01-01 10:00:00', '2019-01-01 10:00:10',
               '2019-01-01 10:00:20', '2019-01-01 10:00:30'],
              dtype='datetime64[ns]', freq='10S')

In [31]:
#date_range()를 이용해 Series의 index를 지정한 예
#특정 날짜로부터 5일간의 판매량을 표시하려면 다음과 같이 입력
index_data = pd.date_range(start='2019-03-01', periods=5, freq ='D')
pd.Series([51,62,55,49,58], index = index_data)

2019-03-01    51
2019-03-02    62
2019-03-03    55
2019-03-04    49
2019-03-05    58
Freq: D, dtype: int64

## DataFrame을 활용한 데이터 생성


- Series를 이용해 1차원 데이터를 생성


- pandas에서는 표(Table)와 같은 2차원 데이터 처리를 위해 DataFrame을 제공
- DataFrame은 이름에서 알 수 있듯이 자료를 담는 틀임
- DataFrame을 이용하면 라벨이 있는 2차원 데이터를 생성하고 처리할 수 있음


- DataFrame을 이용해 데이터를 생성하는 방법
- df=pd.DataFrame(data[,index=index_data, colums=columns_data])
- DataFrame()의 인자인 data에는 리스트와 형태가 유사한 데이터 형태가 유사한 데이터 타입은 모두 사용할 수 있음


- DataFrame의 세로축 라벨을 index라고 하고 가로축 라벨을 columns라고 함
- index와 columns를 제외한 부분을 values라고함


- index와 columns에는 1차원 배열과 유사한 데이터 타입(리스트, NumPy의 배열 데이터, Series 데이터 등)의 데이터를 입력할 수 있음
- DataFrame의 data의 행 개수와 index요소의 개수, data 열의 개수와 columns 요소의 개수가 일치해야 한다는 것
- index와 columns는 선택 사항이므로 입력하지 않을 수 잇는데 그러면 index와 columns에는 자동으로 0부터 숫자가 생성되어 채워짐

In [32]:
#리스트를 이용해 DataFrame의 데이터를 생성하는 예
import pandas as pd

pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

- values 부분에는 입력한 data가 순서대로 입력돼 있고
- 가장 좌측의 열과 가장 윗줄의 행에는 각각 숫자가 자동으로 생성되어 index와 columns가 생성됨

In [34]:
#NumPy의 배열 데이터를 입력해 생성한 DataFrame 데이터의 예

import numpy as np
data_list = np.array([[10,20,30],[40,50,60],[70,80,90]])
pd.DataFrame(data_list)

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

In [37]:
#data 뿐만 아니라 index와 columns도 지정 가능
data = np.array([[1,2,3],[4,5,6],[7,8,9]])
index_data = pd.date_range(start = '2019-09-01', periods=3)#date_range()로 생성된 날짜 입력
columns_list= ['A','B','C']
pd.DataFrame(data, index=index_data, columns=columns_list)#리스트 데이터 입력

            A  B  C
2019-09-01  1  2  3
2019-09-02  4  5  6
2019-09-03  7  8  9

In [39]:
#딕셔너리 타입으로 2차원 데이터를 입력한 예
table_data = {'연도' : pd.date_range(start='2015', periods=5, freq ="AS"),
              '지사' : ['한국','한국','미국','한국','미국'], 
              '고객수' : [200,250,540,300,500]}
table_data

{'고객수': [200, 250, 540, 300, 500],
 '연도': DatetimeIndex(['2015-01-01', '2016-01-01', '2017-01-01', '2018-01-01',
                '2019-01-01'],
               dtype='datetime64[ns]', freq='AS-JAN'),
 '지사': ['한국', '한국', '미국', '한국', '미국']}

In [40]:
#만든 딕셔너리 데이터를 이용해 DataFrame 형식의 데이터를 생성
pd.DataFrame(table_data)

          연도  지사  고객수
0 2015-01-01  한국  200
1 2016-01-01  한국  250
2 2017-01-01  미국  540
3 2018-01-01  한국  300
4 2019-01-01  미국  500

- index는 자동으로 생성됐고 딕셔너리 데이터의 키(keys)는 DataFrame에서 columns로 지정됨
- 표에서 각 열의 제목(고객수, 연도,지사)처럼 들어감


- DataFrame 데이터의 열은 입력한 데이터의 순서대로 생성되지 않았음
- 딕셔너리 데이터가 키(keys)에 따라서 자동으로 정렬됐기 때문이다.
-한글은 가나다순으로 영어는 알페벳 순으로 정렬

In [42]:
# 데이터의 정렬 순서는 다음과 같이 `columns=columns_list`를 이용해 키의 순서를 지정할 수 있음
df = pd.DataFrame(table_data, columns=['연도', '지사', '고객수'])
df

          연도  지사  고객수
0 2015-01-01  한국  200
1 2016-01-01  한국  250
2 2017-01-01  미국  540
3 2018-01-01  한국  300
4 2019-01-01  미국  500

- DataFrame 데이터에서 index, columnsm values는
- 각각 DataFrame_data.index, DataFrame_data.columns, DataFrame_data.values로 확인할 수 있음

In [72]:
# DataFrame 데이터에서 index, columns, values를 각각 구한 예
print(df.index)
print('***************************************************')
print(df.columns)
print('***************************************************')
print(df.values)

RangeIndex(start=0, stop=5, step=1)
***************************************************
Index(['연도', '지사', '고객수'], dtype='object')
***************************************************
[[Timestamp('2015-01-01 00:00:00') '한국' 200]
 [Timestamp('2016-01-01 00:00:00') '한국' 250]
 [Timestamp('2017-01-01 00:00:00') '미국' 540]
 [Timestamp('2018-01-01 00:00:00') '한국' 300]
 [Timestamp('2019-01-01 00:00:00') '미국' 500]]

## 데이터 연산


- pandas의 Series()와 DataFrame()으로 생성한 데이터 끼리는 사칙 연산을 할 수 있다.

In [71]:
# Series()로 생성한 Series 데이터의 예

s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([10,11,12,13,14])

print(s2-s1)
print('***************************************************')
print(s1*s2)
print('***************************************************')
print(s2/s1)
print('***************************************************')
print(s1-s2)

0    9
1    9
2    9
3    9
4    9
dtype: int64
***************************************************
0    10
1    22
2    36
3    52
4    70
dtype: int64
***************************************************
0    10.00
1     5.50
2     4.00
3     3.25
4     2.80
dtype: float64
***************************************************
0   -9
1   -9
2   -9
3   -9
4   -9
dtype: int64

- 파이썬의 리스트와 NumPy의 배열과 달리 pandas의 데이터 끼리는 서로 크기가 달라도 연산할 수 있음

In [70]:
# pandas는 연산할 수 있는 항목만 연산을 수행
s3 = pd.Series([1,2,3,4])
s4 = pd.Series([10,20,30,40,50])
print(s4-s3)
print('***************************************************')
print(s3*s4)
print('***************************************************')
print(s4/s3)

0     9.0
1    18.0
2    27.0
3    36.0
4     NaN
dtype: float64
***************************************************
0     10.0
1     40.0
2     90.0
3    160.0
4      NaN
dtype: float64
***************************************************
0    10.0
1    10.0
2    10.0
3    10.0
4     NaN
dtype: float64

- s3와 s4의 데이터 크기는 다름
- 이 경우 연산할 수 있는 부분만 연산해 결과를 보여주고 연산할 수 없는 부분은 NaN으로 표시

In [47]:
#DataFrame()으로 생성한 DataFrame 데이터끼리도 사칙 연산을 할 수 있음
table_data1 = {'A': [1,2,3,4,5],
               'B': [10,20,30,40,50],
               'C': [100,200,300,400,500]}

df1 = pd.DataFrame(table_data1)
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [50]:
table_data2 = {'A':[6,7,8],
               'B':[60,70,80],
               'C':[600,700,800]}

df2 = pd.DataFrame(table_data2)
df2

   A   B    C
0  6  60  600
1  7  70  700
2  8  80  800

In [51]:
# 두 개의 DataFrame 데이터 길이가 같지 않다.
# 두개의 데이터 길이가 같지 않더라도 앞의 Series처럼 DataFrame도 계산이 가능하다.
df1+df2

      A      B       C
0   7.0   70.0   700.0
1   9.0   90.0   900.0
2  11.0  110.0  1100.0
3   NaN    NaN     NaN
4   NaN    NaN     NaN

- Series 데이터의 경우와 마찬가지로 DataFrame 데이터의 경우도 연산할 수 있는 항목 끼리만 연하하고 그렇지 못한 항목은 NaN으로 표시


- pandas에는 데이터 통계 분석을 위한 다양한 메서드가 있어서 테이터의 총합, 평균, 표준 편차 등을 쉽게 구할 수 있음

In [54]:
# pandas의 메서드로 통계 분석하는 방법
# 2012년 부터 2016년 까지 우리나라의 계절별 강수량(단위 mm)

table_data3 = {'봄':[256.5, 264.3,215.9,223.2,312.8],
               '여름':[770.6,567.5,599.8,387.1, 446.2],
               '가을':[363.3,231.2,293.1,247.7,381.6],
               '겨울': [39.3,59.9,76.9,109.1,108.1]}
columns_list = ['봄','여름','가을','겨울']
index_list = ['2012','2013','2014','2015','2016']

df3 = pd.DataFrame(table_data3, index=index_list, columns=columns_list)
df3

          봄     여름     가을     겨울
2012  256.5  770.6  363.3   39.3
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1

- DataFrame 데이터(df3)를 이용한 통계
- pandas에서 제공하는 통계 메서드는 원소의 합을 구하는 sum(), 평균 mean(), 표준편차 std(), 분산 var(), 최솟값 min(), 최댓값 max() 원소의 누적 합cumsum(), 각 원소의 누적 곱 cumprod()

In [57]:
df3.mean()

봄     254.54
여름    554.24
가을    303.38
겨울     78.66
dtype: float64

In [79]:
df3.cumsum(axis=0)

           봄      여름      가을     겨울
2012   256.5   770.6   363.3   39.3
2013   520.8  1338.1   594.5   99.2
2014   736.7  1937.9   887.6  176.1
2015   959.9  2325.0  1135.3  285.2
2016  1272.7  2771.2  1516.9  393.3

In [58]:
df3.std()

봄      38.628267
여름    148.888895
가을     67.313944
겨울     30.403750
dtype: float64

- mean()과 std()는 연산의 방향을 설정하기 위해 axis 인자를 추가 할 수 있음
- 인자 axis가 0이면 DataFrame의 values에서 열별로 연산을 수행하고, 1이면 행별로 연산을 수행
- axis 인자를 설정하지 않으면 기본값으로 0이 설정

In [61]:
# 연산의 방향을 행 방향으로 설정
df3.mean(axis=1)

2012    357.425
2013    280.725
2014    296.425
2015    241.775
2016    312.175
dtype: float64

In [60]:
df3.sum(axis=1)

2012    1429.7
2013    1122.9
2014    1185.7
2015     967.1
2016    1248.7
dtype: float64

In [92]:
# describe()를 이용하면 평균, 표준편차, 최솟값, 최댓 값 등을 한번에 구할 수 있음

print(df3.describe())

print('*******************')

print(df3.describe().T) #열기준이 아닌 행기준으로 볼때 전치.T사용

                봄          여름          가을         겨울
count    5.000000    5.000000    5.000000    5.00000
mean   254.540000  554.240000  303.380000   78.66000
std     38.628267  148.888895   67.313944   30.40375
min    215.900000  387.100000  231.200000   39.30000
25%    223.200000  446.200000  247.700000   59.90000
50%    256.500000  567.500000  293.100000   76.90000
75%    264.300000  599.800000  363.300000  108.10000
max    312.800000  770.600000  381.600000  109.10000
*******************
    count    mean         std    min    25%    50%    75%    max
봄     5.0  254.54   38.628267  215.9  223.2  256.5  264.3  312.8
여름    5.0  554.24  148.888895  387.1  446.2  567.5  599.8  770.6
가을    5.0  303.38   67.313944  231.2  247.7  293.1  363.3  381.6
겨울    5.0   78.66   30.403750   39.3   59.9   76.9  108.1  109.1

## 데이터를 원하는 대로 선택하기
- pandas의 DataFrame 데이터를 원본 훼손 없이 원하는 부분만 선택하는 방법

In [63]:
# 데이터를 이용해 다음과 같이 DataFrame 데이터를 생성

KTX_data = {'경부선 KTX': [39060, 39896,42005, 43621, 41702, 41266, 32427],
            '호남선 KTX': [7313,6967,6873,6626,8675,10622,9228],
            '경전선 KTX' : [3627,4168,4088,4424,4606,4984,5570],
            '전라선 KTX': [309,1771,1954,2244,3146,3945,5766],
            '동해선 KTX': [np.nan,np.nan,np.nan,np.nan,2395,3786,6667]}
col_list = ['경부선 KTX','호남선 KTX', '경전선 KTX','전라선 KTX', '동해선 KTX']
index_list = ['2011','2012','2013','2014','2015','2016','2017']

df_KTX = pd.DataFrame(KTX_data, index = index_list, columns= col_list)
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [69]:
# DataFrame 데이터의 index, columns, values를 확인하려면 다음과같이 작성
print(df_KTX.index)
print('***************************************************')
print(df_KTX.columns)
print('***************************************************')
print(df_KTX.values)

Index(['2011', '2012', '2013', '2014', '2015', '2016', '2017'], dtype='object')
***************************************************
Index(['경부선 KTX', '호남선 KTX', '경전선 KTX', '전라선 KTX', '동해선 KTX'], dtype='object')
***************************************************
[[39060.  7313.  3627.   309.    nan]
 [39896.  6967.  4168.  1771.    nan]
 [42005.  6873.  4088.  1954.    nan]
 [43621.  6626.  4424.  2244.    nan]
 [41702.  8675.  4606.  3146.  2395.]
 [41266. 10622.  4984.  3945.  3786.]
 [32427.  9228.  5570.  5766.  6667.]]

- pandas에서는 다음과 같이 head()와 tail()을 이용해 DataFrame의 전체 데이터 중 처음 일부 분과 끝 이부분만을 반환하는 것이 가능하다.
- DataFrame_data.head([n])
- DataFrame_data.tail([n])
- 인자 n을 지정하면 head(n)의 경우에는 처음 n개의 행의 데이터를 반환한다. 
- tail(n)의 경우에는 마지막 n개의 행 데이터를 반환한다.
- 인자 n을 지정하지 않으면 기본값으로 5가 지정

In [67]:
#인자 n 없이 DataFrame_data.head() or tail() 을 수행
print(df_KTX.head())
print('***************************************************')

print(df_KTX.tail())

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
***************************************************
      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [68]:
#인자 n을 넣고 DataFrame_data.head() or tail() 을 수행
print(df_KTX.head(3))
print('***************************************************')

print(df_KTX.tail(2))

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
***************************************************
      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

- DataFrame 데이터에서 연속된 구간의 행 데이터를 선택하려면 다음과 같이 `행 시작 위치`와 `끝 위치`를 지정
- DataFrame_data[행_시작_위치: 행_끝 _위치]
- DataFrame 데이터 중에서 `행시작위치 ~ 행끝위치-1`까지의 행 데이터를 반환
- 행의 위치는 0부터 시작

In [80]:
# df_KTX에서 행 위치 1의 행 데이터 하나를 선택
df_KTX[1:2]

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2012    39896     6967     4168     1771      NaN

In [81]:
# 변수 df_KTX에서 행 위치 2에서 4까지의 행 데이터 선택
df_KTX[2:5]

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0

- DataFrame 데이터에서 다음과 같이 index 항목 이름으로 구간을 지정해서 연속된 구간의 행을 선택할 수도 있음
- DataFrame_data.loc[start_index:end_index_name]
- DataFrmae_data의 데이터 중 index가 start_index_name에서 end_index_name가지 구간의 행 데이터를 선택

In [98]:
# df_KTX에서 index로 지정한 항목 중 2013년부터 2016까지의 행 데이터를 선택한 예
print(df_KTX['2013':'2016'])
print('****************************************************')
print(df_KTX.loc['2013':'2016'])

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
****************************************************
      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0

- 데이터에서 하나의 열만 선택하려면 다음과 같이 하나의 columns 항목 이름을 지정
- DataFrame_data[columns_name]
- DataFrame_data 에서 column_name으로 지정한 열이 선택

In [96]:
# df_KTX에서 columns의 항목 중 경부선 KTX를 지정해 하나의 열 데이터만 선택한 예 하나의 열만 지정가능
df_KTX['경부선 KTX']

2011    39060
2012    39896
2013    42005
2014    43621
2015    41702
2016    41266
2017    32427
Name: 경부선 KTX, dtype: int64

- DataFrame 데이터에서 하나의 열을 선택한 후 index의 범위를 지정해 원하는 데이터만 선택할 수도 있음
- DataFrame_data[columns_name][start_index_name:end_index_name]
- DataFrmae_data[columns_name][start_index_pos:end_index_pos]
- columns_name으로 하나의 열을 선택한 후 `start_index_name:end_index_name`으로 index의 이름을 지정해 index의 범위를 선택할 수도 있다.
- `start_index_pos:end_index_pos`로 index의 위치를 지정해 index의 범위를 선택할 수도 있음
- index의 위치는 0부터 시작

In [99]:
# df_KTX에서 경부선 KTX로 열을 선택한 후 2012susdptj 2014년 까지 index의 범위를 index의 이름으로 지정한예
df_KTX['경부선 KTX']['2012':'2014']

2012    39896
2013    42005
2014    43621
Name: 경부선 KTX, dtype: int64

In [100]:
# index의 위치로 범위를 지정한 예
df_KTX['경부선 KTX'][2:5]

2013    42005
2014    43621
2015    41702
Name: 경부선 KTX, dtype: int64

- DataFrame 데이터 중 하나의 원소만 선택하려면 다음 방법 중 하나를 이용
    1. DataFrame_data.loc[index_name][columns_name]
    2. DataFrame_data.loc[index_name,columns_name]
    3. DataFrame_data[columns_name][index_name]
    4. DataFrame_data[columns_name][index_pos]
    5. DataFrame_data[columns_name].loc[index_name]

In [103]:
# df_KTX에서 2016년의 호남선 KTX의 이용자 수를 선택하려면 다음과 같이 여러 방법으로 수행
print(df_KTX.loc['2016']['호남선 KTX'])
print('*************************')
print(df_KTX.loc['2016', '호남선 KTX'])
print('*************************')
print(df_KTX['호남선 KTX']['2016'])
print('*************************')
print(df_KTX['호남선 KTX'][5])
print('*************************')
print(df_KTX['호남선 KTX'].loc['2016'])

10622.0
*************************
10622
*************************
10622
*************************
10622
*************************
10622

- DataFrame 데이터의 행과 열을 바꾸는 방법
- 행렬에서 행과 열을 바꾸는 것을 전치(transpose)
- pandas에서는 다음과 같은 방법으로 DataFrame 데이터의 전치를 구할 수 있음
- DataFrame_data.T

In [106]:
# df_KTX의 전치를 구하는 예
print(df_KTX.T)
print('*************************')
print(df_KTX) #완전 전치되는 것이 아니다.

            2011     2012     2013     2014     2015     2016     2017
경부선 KTX  39060.0  39896.0  42005.0  43621.0  41702.0  41266.0  32427.0
호남선 KTX   7313.0   6967.0   6873.0   6626.0   8675.0  10622.0   9228.0
경전선 KTX   3627.0   4168.0   4088.0   4424.0   4606.0   4984.0   5570.0
전라선 KTX    309.0   1771.0   1954.0   2244.0   3146.0   3945.0   5766.0
동해선 KTX      NaN      NaN      NaN      NaN   2395.0   3786.0   6667.0
*************************
      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [107]:
# DataFrame 데이터 변수 df_KTX에 열의 항목을 지정해 열의 순서를 다음과 같이 변경
df_KTX[['동해선 KTX', '전라선 KTX', '경전선 KTX', '호남선 KTX', '경부선 KTX']]

      동해선 KTX  전라선 KTX  경전선 KTX  호남선 KTX  경부선 KTX
2011      NaN      309     3627     7313    39060
2012      NaN     1771     4168     6967    39896
2013      NaN     1954     4088     6873    42005
2014      NaN     2244     4424     6626    43621
2015   2395.0     3146     4606     8675    41702
2016   3786.0     3945     4984    10622    41266
2017   6667.0     5766     5570     9228    32427

## 데이터 통합하기
- 두개의 데이터를 하나로 통합하는 방법
- 통합 방법에는 세로로 증가하는 방향으로 통합하기
- 가로로 증가하는 방향으로 통합하기
- 특정 열을 기준으로 통합하는 방법

### 세로 방향으로 통합하기 
- DataFrame에서 columns가 같은 두 데이터를 세로 방향(index 증가 방향)으로 합하려면 `append()`사용
- data_Frame_data1.append(DataFrame_data2[,ignore_index=True])
- 세로 방향으로 DataFrame_data1 다음에 DataFrame_data2가 추가돼서 DataFrame 데이터로 변환
- `ignore_index = True`를입력하지 않으면 기존의 데이터 index가 그대로 유지되고, 입력한다면 생성된 DataFrame 데이터에는 데이터 순서대로 새로운 index가 할당

In [108]:
# 두 학급의 시험 점수가 담긴 DataFrame 데이터(df1)를 다음과 같이 생성
import pandas as pd
import numpy as np

df1 = pd.DataFrame({'class1': [5,92,98,100],
                    'class2': [91,93,97,99]})
df1

   class1  class2
0       5      91
1      92      93
2      98      97
3     100      99

In [109]:
# 각각 두명의 학생이 전학을 와서 다음과 같이 Dataframe 데이터를 추가로 생성
df2 = pd.DataFrame({'class1': [87,89],
                    'class2' : [85,90]})
df2

   class1  class2
0      87      85
1      89      90

In [110]:
# append()를 이용해 df1에 df2를 추가해서 데이터를 하나로 만든다.
df1.append(df2)

   class1  class2
0       5      91
1      92      93
2      98      97
3     100      99
0      87      85
1      89      90

In [111]:
#위의 DataFrame은 ignore_index=True를 쓰지않아 기존의 index를 가져옴
df1.append(df2,ignore_index=True)

   class1  class2
0       5      91
1      92      93
2      98      97
3     100      99
4      87      85
5      89      90

In [112]:
#columns가 같지 않음 DataFrame 데이터를 append()를 이용해 추가한다면 데이터가 없는 부분은 NAN으로 채워짐
df3 = pd.DataFrame({'class1': [96,83]})
#열이 두개인 df2에 열이 하나인df3를 추가
df2.append(df3,ignore_index=True)

   class1  class2
0      87    85.0
1      89    90.0
2      96     NaN
3      83     NaN

### 가로 방향으로 통합하기
- index가 같은 두 DataFrame 데이터에 대해 가로방향(columns 증가방향)에 새로운 데이터를 추가하는 방법
- 두개의 DataFrame 데이터를 가로 방향으로 합치려면 다음과 같이 `join()`을 이용
dataFrame_data1.join(dataFrame_data2)
- DataFrame_data1 다음에 가로방향으로 DataFrame_data2가 추가돼서 DataFrame데이터로 반환

In [113]:
#df1과 index 방향으로 크기가 같은 DataFrame 데이터 하나를 생성
df4 = pd.DataFrame({'class3':[93,91,95,98]})
df1.join(df4)

   class1  class2  class3
0       5      91      93
1      92      93      91
2      98      97      95
3     100      99      98

index 라벨을 지정한 DataFrame의 데이터의 경우에도 index가 같으면 `join()`을 이용해 가로방향으로 데이터를 추가할 수 있다.

In [128]:
index_label = ['a','b','c','d']
df1a = pd.DataFrame({'Class1': [95, 92, 98, 100],
                    'Class2': [91, 93, 97, 99]}, index= index_label)
df4a = pd.DataFrame({'Class3': [93, 91, 95, 98]}, index=index_label)

df1a.join(df4a)

   Class1  Class2  Class3
a      95      91      93
b      92      93      91
c      98      97      95
d     100      99      98

In [130]:
#index의 크기가 다른 DataFrame 데이터를 `join()`을 이용해 추가한다면 데이터가 없는 부분은 NaN으로 채워짐
df5 = pd.DataFrame({'class4':[82,92]})
df1.join(df5)

   class1  class2  class4
0       5      91    82.0
1      92      93    92.0
2      98      97     NaN
3     100      99     NaN

### 특정 열을 기준으로 통합하기

- 두개의 DataFrame 데이터를 특정 열을 기준으로 통합
- 특정 열을 키(key)라고함
- 두 개의 DataFrame 데이터에 공통된 열이 있다면 이 열을 기준으로 두데이터를 다음과 같은 방법으로 통합
- DataFrame_left_data.merge(DataFrame_right_data)
- 왼쪽 데이터와 오른쪽 데이터가 공통된 열을 중심으로 좌우로 통합된다.

In [131]:
# 두개의 DataFrame 데이터 생성
df_A_B = pd.DataFrame({'판매월': ['1월', '2월', '3월', '4월'],
                       '제품A': [100, 150, 200, 130],
                       '제품B': [90, 110, 140, 170]})
df_C_D = pd.DataFrame({'판매월': ['1월', '2월', '3월', '4월'],
                       '제품C': [112, 141, 203, 134],
                       '제품D': [90, 110, 140, 170]})

In [132]:
#DataFrame 데이터 df_A_B와 df_C_D에 모두 있는 것이 판매월 인 열 데이터이므로 이를 중심으로 두데이터를 통합
df_A_B.merge(df_C_D)

  판매월  제품A  제품B  제품C  제품D
0  1월  100   90  112   90
1  2월  150  110  141  110
2  3월  200  140  203  140
3  4월  130  170  134  170

- 두 데이터가 판매월을 기준으로 통합
- 특정 열을 기준으로 두 DataFrame 데이터가 모두 값을 갖고 있을대 특정 열을 기준으로 통합


- 두 개의 DataFrame 데이터가 특정 열을 기준으로 일부만 공통된 값을 갖는 경우에 통합
- DataFrame_left_data.merge(DataFrame_right_data,how=merge_method, on = key_label)
- on 인자에는 통합하려는 기준이 되는 특정열의 라벨 이름을 입력
- on 인자를 입력하지 않으면 자동으로 두 데이터에서 공통적으로 포함된 열이 선택
- how 인자에는 지정된 특정 열(key)을 기준으로 통합 방법을 지정

In [133]:
# 두개의 DataFrame 데이터를 생성
df_left = pd.DataFrame({'key':['A','B','C'], 'left': [1, 2, 3]})
df_right = pd.DataFrame({'key':['A','B','D'], 'right': [4, 5, 6]})

#두개의 데이터에서 특정 열의 일부 데이터는 공통으로 있고 나머지는 각각 한쪽에만 있다.
print(df_left.merge(df_right, how='left', on = 'key')) #left 기준
print('***************************************')
print(df_left.merge(df_right, how='right', on = 'key'))# rignt 기준
print('***************************************')
print(df_left.merge(df_right, how='outer', on = 'key')) # 합집합
print('***************************************')
print(df_left.merge(df_right, how='inner', on = 'key')) #교집합

  key  left  right
0   A     1    4.0
1   B     2    5.0
2   C     3    NaN
***************************************
  key  left  right
0   A   1.0      4
1   B   2.0      5
2   D   NaN      6
***************************************
  key  left  right
0   A   1.0    4.0
1   B   2.0    5.0
2   C   3.0    NaN
3   D   NaN    6.0
***************************************
  key  left  right
0   A     1      4
1   B     2      5

In [114]:
!cat sea_rain1.csv

연도,동해,남해,서해,전체
1996,17.4629,17.2288,14.436,15.9067
1997,17.4116,17.4092,14.8248,16.1526
1998,17.5944,18.011,15.2512,16.6044
1999,18.1495,18.3175,14.8979,16.6284
2000,17.9288,18.1766,15.0504,16.6178

In [115]:
import pandas as pd

pd.read_csv('sea_rain1.csv')

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [117]:
#메모장에서 읽어올때 cp949로 인코딩해온다.
pd.read_csv('sea_rain1_from_notepad.csv', encoding="cp949")

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

### 표 형식의 데이터를 파일로 쓰기
- pandas에서 제공하는 to_csv()를 이용해 DataFrame 형식의 데이터를 텍스트 파일로 저장하는 방법
- DataFrame_data.to_csv(file_name[,options])
- file_name은 텍스트 파일 이름으로 경로를 포함
- 선택사항인 options 에는 구분자와 문자의 인코딩 방식 등을 지정할 수 있는데 지정하지 않으면 구분자는 콤마가 되고 문자의 인코딩 방식은 `utf-8`


- DataFrame 데이터를 파일로 저장하기 위해 
- 네 명의 몸무게와 키 데이터를 DataFrame형식으로 생성
- DataFrame데이터에서 index에 이름을 추가하고 싶으면 `df.index.name=문자열`과 같이 작성

In [118]:
df_WH = pd.DataFrame({'Weight':[62,67,55,74],
                      'Height': [165,177,160,180]},
                     index = ['ID_1', 'ID_2','ID_3','ID_4'])
df_WH.index.name = 'Users'
df_WH

       Weight  Height
Users
ID_1       62     165
ID_2       67     177
ID_3       55     160
ID_4       74     180

- 파일로 저장하기 전에 몸무게와 키를 이용해 체질량 지수(BMI)를 구해서 dtWH에 추가 
- df_WH의 몸무게와 키 데이터를 이용해 체질량 지수를 구함

In [119]:
#- 키의 경우 입력한 데이터는 cm단위여서 m단위로 변경하기 위해 100으로나눔
bmi = df_WH['Weight']/(df_WH['Height']/100)**2
# DataFrame에 새로운 열 데이터를 추가
df_WH['BMI'] = bmi
df_WH

       Weight  Height        BMI
Users
ID_1       62     165  22.773186
ID_2       67     177  21.385936
ID_3       55     160  21.484375
ID_4       74     180  22.839506

In [120]:
# DataFrame 데이터 df_WH를 csv 파일로 저장
df_WH.to_csv('save_DataFrame.csv')

In [121]:
!cat save_DataFrame.csv

Users,Weight,Height,BMI
ID_1,62,165,22.77318640955005
ID_2,67,177,21.38593635289987
ID_3,55,160,21.484374999999996
ID_4,74,180,22.839506172839506

In [124]:
#DataFrame 데이터를 파일로 저장할 때 옵션을 지정하는 예제
df_pr = pd.DataFrame({'판매가격': [2000,3000,5000,10000],
                      '판매량': [32,53,40,25]},
                     index =['P1001','P1002','P1003','P1004'])
df_pr.index.name = '제품번호'
df_pr

        판매가격  판매량
제품번호
P1001   2000   32
P1002   3000   53
P1003   5000   40
P1004  10000   25

In [125]:
# DataFrame 데이터 df_pr을 텍스트 파일로 저장
file_name = 'save_DataFrame_cp949.txt'
df_pr.to_csv(file_name, sep = " ",encoding = 'cp949')

In [127]:
#저장된 파일을 확인
!cat save_DataFrame_cp949.txt

��ǰ��ȣ �ǸŰ��� �Ǹŷ�
P1001 2000 32
P1002 3000 53
P1003 5000 40
P1004 10000 25

## 11.3 정리
- 데이터 분석에 아주 유용하게 활용할 수 있는 NumPy와 pandas
- 파이썬 프로그램을 작성할 때는 파이썬의 기본 기능과 외부 패키지나 라이브러리를 함게이용
- python Package Index 홈페이지(https://pypi.org)